# Public transport Demand DataSet

1. First we have to import the dataset and all the required libraries for the project

In [1]:
import pandas as pd
import numpy as np
import datetime

2.  We are first going to get the data from the local machine 
3.  Second we explore the data in order to be aware of what the data you are dealing with is about

In [2]:
data = pd.read_csv('train_revised.csv')

In [3]:
data

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,1442,15A,Mpesa,UZUEHCBUSO,17-10-17,7:15,Migori,Nairobi,Bus,49
1,5437,14A,Mpesa,TIHLBUSGTE,19-11-17,7:12,Migori,Nairobi,Bus,49
2,5710,8B,Mpesa,EQX8Q5G19O,26-11-17,7:05,Keroka,Nairobi,Bus,49
3,5777,19A,Mpesa,SGP18CL0ME,27-11-17,7:10,Homa Bay,Nairobi,Bus,49
4,5778,11A,Mpesa,BM97HFRGL9,27-11-17,7:12,Migori,Nairobi,Bus,49
...,...,...,...,...,...,...,...,...,...,...
51640,13826,9B,Mpesa,8V2XDDZR6V,20-04-18,8:00,Awendo,Nairobi,Bus,49
51641,13809,18A,Mpesa,4PEBSVJSNK,20-04-18,8:00,Migori,Nairobi,Bus,49
51642,13809,17A,Mpesa,LVN64LZDNN,20-04-18,8:00,Migori,Nairobi,Bus,49
51643,13796,16B,Mpesa,REYBSKTYWN,20-04-18,7:08,Awendo,Nairobi,Bus,49
51644,14304,7,Mpesa,AQN7FBUSGP,14-11-17,5:10,Kisii,Nairobi,Bus,49

In [4]:
data.columns

Index(['ride_id', 'seat_number', 'payment_method', 'payment_receipt',
       'travel_date', 'travel_time', 'travel_from', 'travel_to', 'car_type',
       'max_capacity'],
      dtype='object')

In [5]:
data.shape

(51645, 10)

In [6]:
data.sample(20)

,ride_id,seat_number,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
1025,6396,1X,Mpesa,JCUPVLJRGN,01-12-17,5:40,Keroka,Nairobi,shuttle,11
17805,8983,11A,Mpesa,MNVMJJKIIK,22-01-18,7:15,Migori,Nairobi,Bus,49
37107,11785,17A,Mpesa,YYED6JUTQ1,07-03-18,7:04,Homa Bay,Nairobi,Bus,49
18826,9160,1,Mpesa,HBPFSGZGXJ,29-01-18,8:50,Kisii,Nairobi,shuttle,11
6135,7260,4,Mpesa,GF8SZ3TK7G,02-03-18,7:40,Kisii,Nairobi,shuttle,11
26695,10534,10,Mpesa,VIZM0UFKM7,22-12-17,9:20,Kisii,Nairobi,shuttle,11
38256,11926,7B,Mpesa,90RITOQHUT,09-03-18,7:04,Rongo,Nairobi,Bus,49
19772,9280,8,Mpesa,1VEDKLCECD,28-01-18,10:20,Kisii,Nairobi,shuttle,11
29498,10873,7,Mpesa,BCKTXJYOQY,18-12-17,9:10,Kisii,Nairobi,shuttle,11
32319,11276,7,Mpesa,67IOWBMEYH,14-12-17,10:58,Kisii,Nairobi,shuttle,11
8460,7632,21A,Mpesa,ARTXOFSKLY,17-12-17,7:07,Kijauri,Nairobi,Bus,49
12985,8297,4,Mpesa,6RIMOEDBKZ,11-02-18,10:20,Kisii,Nairobi,shuttle,11
24483,10120,8A,Mpesa,SSYOIOEEGA,09-02-18,7:13,Kehancha,Nairobi,Bus,49
46713,13184,6B,Mpesa,EXJ6QT8OGM,08-04-18,7:03,Mbita,Nairobi,Bus,49
28036,10701,2,Mpesa,BMYGTISMCZ,20-12-17,8:50,Kisii,Nairobi,shuttle,11
8331,7617,1,Mpesa,JED54ZD28N,21-02-18,10:00,Kisii,Nairobi,shuttle,11
8507,7636,9,Mpesa,LAB6JAWY59,21-02-18,7:20,Kisii,Nairobi,shuttle,11
25869,10391,6,Mpesa,5PGYJVQKT7,29-12-17,10:56,Kisii,Nairobi,shuttle,11
15128,8575,3B,Mpesa,WECFRQMB4I,12-01-18,7:15,Migori,Nairobi,Bus,49
24196,10059,8,Mpesa,C8MABJP80T,08-02-18,9:00,Keroka,Nairobi,shuttle,11

In [7]:
data['payment_method'].unique()

array(['Mpesa', 'Cash'], dtype=object)

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ride_id          51645 non-null  int64
 1   seat_number      51645 non-null  object
 2   payment_method   51645 non-null  object
 3   payment_receipt  51645 non-null  object
 4   travel_date      51645 non-null  object
 5   travel_time      51645 non-null  object
 6   travel_from      51645 non-null  object
 7   travel_to        51645 non-null  object
 8   car_type         51645 non-null  object
 9   max_capacity     51645 non-null  int64
dtypes: int64(2), object(8)
memory usage: 3.9+ MB

In [9]:
data['travel_from'].unique()

array(['Migori', 'Keroka', 'Homa Bay', 'Kisii', 'Keumbu', 'Rongo',
       'Kijauri', 'Oyugis', 'Awendo', 'Sirare', 'Nyachenge', 'Kehancha',
       'Kendu Bay', 'Sori', 'Rodi', 'Mbita', 'Ndhiwa'], dtype=object)

In [10]:
data['travel_to']. unique()

array(['Nairobi'], dtype=object)

In [11]:
data['car_type']. unique()

array(['Bus', 'shuttle'], dtype=object)

In [12]:
data['max_capacity'].unique()

array([49, 11], dtype=int64)

In [13]:
data['travel_time'].unique()

array(['7:15', '7:12', '7:05', '7:10', '7:09', '5:10', '9:50', '7:06',
       '6:00', '5:50', '10:58', '6:50', '5:30', '6:40', '9:10', '5:00',
       '5:20', '10:52', '10:50', '10:51', '8:20', '19:03', '7:02', '6:30',
       '7:20', '7:04', '19:05', '19:04', '6:59', '7:08', '5:40', '9:00',
       '7:14', '7:07', '8:00', '7:30', '10:57', '8:30', '11:01', '7:11',
       '7:03', '6:58', '11:05', '10:20', '10:53', '10:00', '8:50',
       '10:54', '7:01', '7:00', '6:10', '6:20', '10:10', '11:02', '9:40',
       '9:30', '7:50', '10:56', '10:55', '10:40', '10:30', '9:20', '8:40',
       '8:10', '7:40', '7:13', '11:00', '11:04', '19:06', '10:59',
       '11:07', '11:06', '11:03', '19:07', '11:08', '11:09', '23:09',
       '23:10'], dtype=object)

In [14]:
data['travel_date'].unique()

array(['17-10-17', '19-11-17', '26-11-17', '27-11-17', '20-04-18',
       '19-04-18', '18-04-18', '17-04-18', '16-04-18', '15-04-18',
       '14-04-18', '13-04-18', '12-04-18', '11-04-18', '28-11-17',
       '10-04-18', '09-04-18', '08-04-18', '07-04-18', '06-04-18',
       '05-04-18', '04-04-18', '03-04-18', '02-04-18', '01-04-18',
       '31-03-18', '30-03-18', '29-03-18', '28-03-18', '27-03-18',
       '29-11-17', '26-03-18', '25-03-18', '24-03-18', '23-03-18',
       '22-03-18', '21-03-18', '20-03-18', '19-03-18', '18-03-18',
       '17-03-18', '16-03-18', '30-11-17', '01-12-17', '15-03-18',
       '02-12-17', '14-03-18', '13-03-18', '03-12-17', '04-12-17',
       '12-03-18', '05-12-17', '11-03-18', '06-12-17', '10-03-18',
       '09-03-18', '07-12-17', '08-03-18', '08-12-17', '07-03-18',
       '06-03-18', '09-12-17', '10-12-17', '05-03-18', '04-03-18',
       '11-12-17', '12-12-17', '03-03-18', '02-03-18', '13-12-17',
       '01-03-18', '14-12-17', '28-02-18', '27-02-18', '15-12-17',
       '26-02-18', '25-02-18', '24-02-18', '23-02-18', '16-12-17',
       '17-12-17', '22-02-18', '21-02-18', '18-12-17', '20-02-18',
       '19-02-18', '19-12-17', '18-02-18', '20-12-17', '17-02-18',
       '16-02-18', '21-12-17', '15-02-18', '22-12-17', '14-02-18',
       '13-02-18', '23-12-17', '24-12-17', '26-12-17', '27-12-17',
       '28-12-17', '29-12-17', '12-02-18', '30-12-17', '31-12-17',
       '01-01-18', '02-01-18', '03-01-18', '11-02-18', '04-01-18',
       '05-01-18', '06-01-18', '10-02-18', '09-02-18', '07-01-18',
       '08-01-18', '09-01-18', '08-02-18', '10-01-18', '11-01-18',
       '07-02-18', '06-02-18', '12-01-18', '13-01-18', '05-02-18',
       '14-01-18', '15-01-18', '16-01-18', '04-02-18', '17-01-18',
       '18-01-18', '03-02-18', '19-01-18', '02-02-18', '20-01-18',
       '21-01-18', '22-01-18', '01-02-18', '31-01-18', '23-01-18',
       '30-01-18', '24-01-18', '29-01-18', '25-01-18', '26-01-18',
       '27-01-18', '28-01-18', '25-12-17', '14-11-17'], dtype=object)

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ride_id          51645 non-null  int64
 1   seat_number      51645 non-null  object
 2   payment_method   51645 non-null  object
 3   payment_receipt  51645 non-null  object
 4   travel_date      51645 non-null  object
 5   travel_time      51645 non-null  object
 6   travel_from      51645 non-null  object
 7   travel_to        51645 non-null  object
 8   car_type         51645 non-null  object
 9   max_capacity     51645 non-null  int64
dtypes: int64(2), object(8)
memory usage: 3.9+ MB

In [16]:
# drop the columns that are insignificant 
data.drop(['ride_id', 'seat_number'], axis=1, inplace=True)

In [17]:
data

,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity
0,Mpesa,UZUEHCBUSO,17-10-17,7:15,Migori,Nairobi,Bus,49
1,Mpesa,TIHLBUSGTE,19-11-17,7:12,Migori,Nairobi,Bus,49
2,Mpesa,EQX8Q5G19O,26-11-17,7:05,Keroka,Nairobi,Bus,49
3,Mpesa,SGP18CL0ME,27-11-17,7:10,Homa Bay,Nairobi,Bus,49
4,Mpesa,BM97HFRGL9,27-11-17,7:12,Migori,Nairobi,Bus,49
...,...,...,...,...,...,...,...,...
51640,Mpesa,8V2XDDZR6V,20-04-18,8:00,Awendo,Nairobi,Bus,49
51641,Mpesa,4PEBSVJSNK,20-04-18,8:00,Migori,Nairobi,Bus,49
51642,Mpesa,LVN64LZDNN,20-04-18,8:00,Migori,Nairobi,Bus,49
51643,Mpesa,REYBSKTYWN,20-04-18,7:08,Awendo,Nairobi,Bus,49
51644,Mpesa,AQN7FBUSGP,14-11-17,5:10,Kisii,Nairobi,Bus,49

In [18]:
data['travel_date']= pd.to_datetime(data['travel_date'])

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   payment_method   51645 non-null  object
 1   payment_receipt  51645 non-null  object
 2   travel_date      51645 non-null  datetime64[ns]
 3   travel_time      51645 non-null  object
 4   travel_from      51645 non-null  object
 5   travel_to        51645 non-null  object
 6   car_type         51645 non-null  object
 7   max_capacity     51645 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 3.2+ MB

Next, since the data type of the date column is an object, we will change the date column from object type  to date type

In [20]:
data['travel_date'] = pd.to_datetime(data['travel_date'].astype(str))

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   payment_method   51645 non-null  object
 1   payment_receipt  51645 non-null  object
 2   travel_date      51645 non-null  datetime64[ns]
 3   travel_time      51645 non-null  object
 4   travel_from      51645 non-null  object
 5   travel_to        51645 non-null  object
 6   car_type         51645 non-null  object
 7   max_capacity     51645 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 3.2+ MB

From the travel_date we get the day of the week represented as an integer with 0 as Monday, 2 as tuesday, 3 as wednesday, 4 as friday, 5 as saturday and 6 as Sunday

In [22]:
day = data['travel_date'].dt.dayofweek

In [23]:
day

0        1
1        6
2        6
3        0
4        0
        ..
51640    4
51641    4
51642    4
51643    4
51644    1
Name: travel_date, Length: 51645, dtype: int64

In [24]:
day.unique()

array([1, 6, 0, 4, 3, 2, 5], dtype=int64)

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   payment_method   51645 non-null  object
 1   payment_receipt  51645 non-null  object
 2   travel_date      51645 non-null  datetime64[ns]
 3   travel_time      51645 non-null  object
 4   travel_from      51645 non-null  object
 5   travel_to        51645 non-null  object
 6   car_type         51645 non-null  object
 7   max_capacity     51645 non-null  int64
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 3.2+ MB

In [26]:
data['day_of_week'] = day

In [27]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   payment_method   51645 non-null  object
 1   payment_receipt  51645 non-null  object
 2   travel_date      51645 non-null  datetime64[ns]
 3   travel_time      51645 non-null  object
 4   travel_from      51645 non-null  object
 5   travel_to        51645 non-null  object
 6   car_type         51645 non-null  object
 7   max_capacity     51645 non-null  int64
 8   day_of_week      51645 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(6)
memory usage: 3.5+ MB

In [28]:
data['travel_from'].value_counts()

Kisii        22607
Migori        7027
Homa Bay      6304
Sirare        4449
Rongo         3928
Kehancha      1909
Awendo        1788
Kijauri       1031
Keroka         988
Nyachenge      512
Rodi           405
Mbita          378
Ndhiwa         236
Sori            55
Keumbu          22
Oyugis           5
Kendu Bay        1
Name: travel_from, dtype: int64

In [29]:
data['travel_from'].value_counts().sum()

51645

In [30]:
Sunday_routes = data[data['day_of_week'] == 6]

In [31]:
Sunday_routes['travel_from'].value_counts()

Kisii        2756
Migori        973
Homa Bay      910
Sirare        629
Rongo         538
Kehancha      301
Awendo        296
Kijauri       115
Nyachenge      85
Mbita          83
Rodi           63
Ndhiwa         45
Keroka         41
Sori            9
Keumbu          3
Name: travel_from, dtype: int64

# Question 1

In [32]:
Total = Sunday_routes[Sunday_routes['travel_from'].isin(['Kisii','Migori','Homa Bay','Sirare','Rongo','Kehancha','Awendo'])].value_counts().sum()

In [33]:
# sum of the trips from the top 7 routes
Total

6403

In [34]:
Average_travel_sunday = Total / 7

From the data obtained for routes that were travelled on sunday, the 7 most travelled the everage obtained is below

In [35]:
# on average the number of trips that were made for the 7 routes is 
Average_travel_sunday

914.7142857142857

From the dataset, it is unsure to know the actual number of days since assuming that maybe some days there may have been some sundays where there may not have been any travelling.From the site we know that the data was collected from  17 October 2017 and 20 April 2018 hence this can be able to help identify the actual number of sundays that were there during that period

In [36]:
from datetime import date

d1 = date(2017, 10, 17)
d2 = date(2018, 4, 20)

num_of_days = d2 - d1

Total_days= num_of_days.days

In [37]:
Total_days

185

There are 185 number of days from the period, I wil then divide this by 7 to find the number of weeks that existed during that period. This will help to know how many weeks they were and hence know the number of Sundays that were there over that period

In [38]:
num_of_sundays = Total_days/7

num_of_sundays

26.428571428571427

There were roughly 26.428571428571427 number of Sundays within that period

In [39]:
Sun_routes_df=pd.DataFrame(Sunday_routes['travel_from'].value_counts())

In [40]:
Sun_routes_df

           travel_from
Kisii             2756
Migori             973
Homa Bay           910
Sirare             629
Rongo              538
Kehancha           301
Awendo             296
Kijauri            115
Nyachenge           85
Mbita               83
Rodi                63
Ndhiwa              45
Keroka              41
Sori                 9
Keumbu               3

In [41]:
# The average of each route ranked in descending order is as follows
Sun_routes_df[:7]/num_of_sundays

          travel_from
Kisii      104.281081
Migori      36.816216
Homa Bay    34.432432
Sirare      23.800000
Rongo       20.356757
Kehancha    11.389189
Awendo      11.200000

# Question 2

The probability of a passenger taking a shuttle is 1 / (number od vehicles to depature at the time(2)) and the probability of a passenger leaving before 7:30 is 1 / (the number of depatures that are there before 7:30 at Kijauri). When the two probabilities are obtained, you will then get the product of the two probabilities to get the probability of a passenger taking a shuttle from kijauri and departing before 7:30

In [42]:
data

,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity,day_of_week
0,Mpesa,UZUEHCBUSO,2017-10-17,7:15,Migori,Nairobi,Bus,49,1
1,Mpesa,TIHLBUSGTE,2017-11-19,7:12,Migori,Nairobi,Bus,49,6
2,Mpesa,EQX8Q5G19O,2017-11-26,7:05,Keroka,Nairobi,Bus,49,6
3,Mpesa,SGP18CL0ME,2017-11-27,7:10,Homa Bay,Nairobi,Bus,49,0
4,Mpesa,BM97HFRGL9,2017-11-27,7:12,Migori,Nairobi,Bus,49,0
...,...,...,...,...,...,...,...,...,...
51640,Mpesa,8V2XDDZR6V,2018-04-20,8:00,Awendo,Nairobi,Bus,49,4
51641,Mpesa,4PEBSVJSNK,2018-04-20,8:00,Migori,Nairobi,Bus,49,4
51642,Mpesa,LVN64LZDNN,2018-04-20,8:00,Migori,Nairobi,Bus,49,4
51643,Mpesa,REYBSKTYWN,2018-04-20,7:08,Awendo,Nairobi,Bus,49,4
51644,Mpesa,AQN7FBUSGP,2017-11-14,5:10,Kisii,Nairobi,Bus,49,1

In [44]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   payment_method   51645 non-null  object
 1   payment_receipt  51645 non-null  object
 2   travel_date      51645 non-null  datetime64[ns]
 3   travel_time      51645 non-null  object
 4   travel_from      51645 non-null  object
 5   travel_to        51645 non-null  object
 6   car_type         51645 non-null  object
 7   max_capacity     51645 non-null  int64
 8   day_of_week      51645 non-null  int64
dtypes: datetime64[ns](1), int64(2), object(6)
memory usage: 3.5+ MB

In [57]:
data['travel_time']= pd.to_datetime(data['travel_time'])

In [58]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51645 entries, 0 to 51644
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   payment_method   51645 non-null  object
 1   payment_receipt  51645 non-null  object
 2   travel_date      51645 non-null  datetime64[ns]
 3   travel_time      51645 non-null  datetime64[ns]
 4   travel_from      51645 non-null  object
 5   travel_to        51645 non-null  object
 6   car_type         51645 non-null  object
 7   max_capacity     51645 non-null  int64
 8   day_of_week      51645 non-null  int64
dtypes: datetime64[ns](2), int64(2), object(5)
memory usage: 3.5+ MB

In [70]:
# getting the specific time to look for in the data
date = pd.to_datetime('2022-05-10 07:30:00')

In [76]:
before_7_30=data[data['travel_time']< date]

In [77]:
# records for leaving before 7:30
before_7_30

,payment_method,payment_receipt,travel_date,travel_time,travel_from,travel_to,car_type,max_capacity,day_of_week
0,Mpesa,UZUEHCBUSO,2017-10-17,2022-05-10 07:15:00,Migori,Nairobi,Bus,49,1
1,Mpesa,TIHLBUSGTE,2017-11-19,2022-05-10 07:12:00,Migori,Nairobi,Bus,49,6
2,Mpesa,EQX8Q5G19O,2017-11-26,2022-05-10 07:05:00,Keroka,Nairobi,Bus,49,6
3,Mpesa,SGP18CL0ME,2017-11-27,2022-05-10 07:10:00,Homa Bay,Nairobi,Bus,49,0
4,Mpesa,BM97HFRGL9,2017-11-27,2022-05-10 07:12:00,Migori,Nairobi,Bus,49,0
...,...,...,...,...,...,...,...,...,...
51633,Mpesa,TWTES0YBWD,2018-04-20,2022-05-10 07:05:00,Ndhiwa,Nairobi,Bus,49,4
51636,Mpesa,QDV5QMHCG0,2018-04-20,2022-05-10 07:05:00,Ndhiwa,Nairobi,Bus,49,4
51639,Mpesa,B3R9XWCV9O,2018-04-20,2022-05-10 07:09:00,Rongo,Nairobi,Bus,49,4
51643,Mpesa,REYBSKTYWN,2018-04-20,2022-05-10 07:08:00,Awendo,Nairobi,Bus,49,4
51644,Mpesa,AQN7FBUSGP,2017-11-14,2022-05-10 05:10:00,Kisii,Nairobi,Bus,49,1

In [87]:
# leaving Kijauri before 7:30 + 
Kijauri_b4 = data[(data['travel_from']=='Kijauri')&(data['travel_time']<date)]

In [95]:
Kijauri_b4['travel_time'] = Kijauri_b4['travel_time'].astype(str)

C:\Users\Admin\AppData\Local\Temp/ipykernel_10272/2952269067.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Kijauri_b4['travel_time'] = Kijauri_b4['travel_time'].astype(str)

In [96]:
Kijauri_b4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 819 entries, 1625 to 51469
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   payment_method   819 non-null    object
 1   payment_receipt  819 non-null    object
 2   travel_date      819 non-null    datetime64[ns]
 3   travel_time      819 non-null    object
 4   travel_from      819 non-null    object
 5   travel_to        819 non-null    object
 6   car_type         819 non-null    object
 7   max_capacity     819 non-null    int64
 8   day_of_week      819 non-null    int64
dtypes: datetime64[ns](1), int64(2), object(6)
memory usage: 64.0+ KB

In [107]:
Kijauri_b4['travel_time'].value_counts().sum()

819

In [82]:
p1 = 1/2
p1

0.5

In [84]:
p2 = 1/819
p2

0.001221001221001221

In [85]:
Overall =p1*p2* 100
Overall

0.06105006105006105

the Probability that a passenger travelling from Kijauri will take a Shuttle if they depart before 07:30 is 0.06105006105006105%

# Quesion 3